In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(':memory:')

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [3]:
data = pd.read_csv('boston.csv')
data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [4]:
data.to_sql('boston', con, index=False, if_exists='replace')

506

In [5]:
pd.read_sql(
    '''
    SELECT * FROM boston
    limit 5
    ''',
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [6]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [7]:
tasks+=1
pd.read_sql(
    '''
    SELECT
        sum(case when CRIM is NULL then 1 else 0 end) as crim_null,
        sum(case when ZN is NULL then 1 else 0 end) as zn_null,
        sum(case when INDUS is NULL then 1 else 0 end) as indus_null,
        sum(case when CHAS is NULL then 1 else 0 end) as chas_null,
        sum(case when NOX is NULL then 1 else 0 end) as nox_null
        
    FROM boston
    ''',
    con,
)

   crim_null  zn_null  indus_null  chas_null  nox_null
0          0        0           0          0         0

2. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–æ–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [10]:
tasks+=1
pd.read_sql(
    '''
    SELECT 
    COUNT(DISTINCT CRIM) as CRIM,
    COUNT(DISTINCT ZN) as ZN, 
    COUNT(DISTINCT INDUS) as INDUS,
    COUNT(DISTINCT CHAS) as CHAS,
    COUNT(DISTINCT NOX) as NOX
    FROM boston
    ''',
    con,
)

   CRIM  ZN  INDUS  CHAS  NOX
0   504  26     76     2   81

3. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö –º–µ–¥–∏–∞–Ω–∞ —Ä–∞–≤–Ω–∞ –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–º—É –∑–Ω–∞—á–µ–Ω–∏—é (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX.
–ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ –¥–∞–Ω–Ω—ã–º –≤ —ç—Ç–∏—Ö –∫–æ–ª–æ–Ω–∫–∞—Ö

In [11]:
tasks+=1
pd.read_sql(
    '''
WITH
all_data as
(
    SELECT 'crim' as key, crim as value 
    FROM boston
    
    UNION ALL
    SELECT 'zn' as key, zn as value 
    FROM boston
    
    UNION ALL
    SELECT 'chas' as key, chas as value 
    FROM boston
    
    UNION ALL
    SELECT 'indus' as key, indus as value 
    FROM boston
    
    UNION ALL
    SELECT 'nox' as key, nox as value 
    FROM boston
),
stat_table as
(
    SELECT key, value,
           row_number() over(partition by key order by value) as rn,
           min(value) over(partition by key) min_value,
           count(value) over(partition by key) as cnt
    FROM all_data
)
    

SELECT key FROM (
                    SELECT key, value as md_value, min_value
                    FROM stat_table
                    WHERE rn = cnt/2
                )
WHERE md_value=min_value
    ''',
    con,
)

    key
0  chas
1    zn

##### –ë–æ–ª—å—à–µ –ø–æ–ª–æ–≤–∏–Ω—ã —É—á–∞—Å—Ç–∫–æ–≤ –Ω–µ –≥—Ä–∞–Ω–∏—á–∞—Ç —Å —Ä–µ–∫–æ–π –∏ –∏–º–µ—é—Ç –ø–ª–æ—â–∞–¥—å –º–µ–Ω–µ–µ 25000 –∫–≤. —Ñ—É—Ç–æ–≤.

4. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–∑–Ω–∏—Ü—É –º–µ–∂–¥—É —Å—Ä–µ–¥–Ω–µ–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ–º –∫–æ–º–Ω–∞—Ç(RM) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é(MEDV) –∏ 25 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. 
–ê–Ω–∞–ª–æ–≥–∏—á–Ω–æ –ø–æ 50, 100, 200, 300 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. (–∫–æ–ª-–≤–æ –¥–æ–º–æ–≤(25,50,100,200,300), —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –Ω–∏—Ö, —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö, —Ä–∞–∑–Ω–∏—Ü–∞).
–ù–∞–ø–∏—à–∏—Ç–µ –≤–ª–∏—è–µ—Ç –ª–∏ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –∏ –∫–∞–∫ —Å–∏–ª—å–Ω–æ.

In [12]:
tasks+=1
pd.read_sql(
    '''
    SELECT 25 as "–ö–æ–ª–∏—á–µ—Å—Ç–≤–æ –¥–æ–º–æ–≤", AVG(ARM) as '–°—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç',
    
    (SELECT AVG(RM) OVER(partition by MEDV order by MEDV) as AVGRM_MAXPRICE
    FROM boston
    ORDER BY MEDV DESC
    LIMIT 1) as '–°—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö',
    
    AVG(ARM-(
    SELECT AVG(RM) OVER(partition by MEDV order by MEDV) as AVGRM_MAXPRICE
    FROM boston
    ORDER BY MEDV DESC
    LIMIT 1)) as –†–∞–∑–Ω–∏—Ü–∞
    FROM (SELECT RM as ARM FROM boston ORDER BY MEDV LIMIT 25)
    
    UNION ALL
    SELECT 50 as "–ö–æ–ª–∏—á–µ—Å—Ç–≤–æ –¥–æ–º–æ–≤", AVG(ARM) as '–°—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç',
    
    (SELECT AVG(RM) OVER(partition by MEDV order by MEDV) as AVGRM_MAXPRICE
    FROM boston
    ORDER BY MEDV DESC
    LIMIT 1) as '–°—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö',
    
    AVG(ARM-(
    SELECT AVG(RM) OVER(partition by MEDV order by MEDV) as AVGRM_MAXPRICE
    FROM boston
    ORDER BY MEDV DESC
    LIMIT 1)) as –†–∞–∑–Ω–∏—Ü–∞
    FROM (SELECT RM as ARM FROM boston ORDER BY MEDV LIMIT 50)
    
    UNION ALL
    SELECT 100 as "–ö–æ–ª–∏—á–µ—Å—Ç–≤–æ –¥–æ–º–æ–≤", AVG(ARM) as '–°—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç',
    
    (SELECT AVG(RM) OVER(partition by MEDV order by MEDV) as AVGRM_MAXPRICE
    FROM boston
    ORDER BY MEDV DESC
    LIMIT 1) as '–°—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö',
    
    AVG(ARM-(
    SELECT AVG(RM) OVER(partition by MEDV order by MEDV) as AVGRM_MAXPRICE
    FROM boston
    ORDER BY MEDV DESC
    LIMIT 1)) as –†–∞–∑–Ω–∏—Ü–∞
    FROM (SELECT RM as ARM FROM boston ORDER BY MEDV LIMIT 100)
    
    UNION ALL
    SELECT 200 as "–ö–æ–ª–∏—á–µ—Å—Ç–≤–æ –¥–æ–º–æ–≤", AVG(ARM) as '–°—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç',
    
    (SELECT AVG(RM) OVER(partition by MEDV order by MEDV) as AVGRM_MAXPRICE
    FROM boston
    ORDER BY MEDV DESC
    LIMIT 1) as '–°—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö',
    
    AVG(ARM-(
    SELECT AVG(RM) OVER(partition by MEDV order by MEDV) as AVGRM_MAXPRICE
    FROM boston
    ORDER BY MEDV DESC
    LIMIT 1)) as –†–∞–∑–Ω–∏—Ü–∞
    FROM (SELECT RM as ARM FROM boston ORDER BY MEDV LIMIT 200)
    
    UNION ALL
    SELECT 300 as "–ö–æ–ª–∏—á–µ—Å—Ç–≤–æ –¥–æ–º–æ–≤", AVG(ARM) as '–°—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç',
    
    (SELECT AVG(RM) OVER(partition by MEDV order by MEDV) as AVGRM_MAXPRICE
    FROM boston
    ORDER BY MEDV DESC
    LIMIT 1) as '–°—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö',
    
    AVG(ARM-(
    SELECT AVG(RM) OVER(partition by MEDV order by MEDV) as AVGRM_MAXPRICE
    FROM boston
    ORDER BY MEDV DESC
    LIMIT 1)) as –†–∞–∑–Ω–∏—Ü–∞
    FROM (SELECT RM as ARM FROM boston ORDER BY MEDV LIMIT 300)

    ''',
    con,
)

,–ö–æ–ª–∏—á–µ—Å—Ç–≤–æ –¥–æ–º–æ–≤,–°—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç,–°—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö,–†–∞–∑–Ω–∏—Ü–∞
0,25,5.747840,7.484,-1.736160
1,50,5.753240,7.484,-1.730760
2,100,5.887120,7.484,-1.596880
3,200,5.911705,7.484,-1.572295
4,300,5.972227,7.484,-1.511773

#####  –û–ø–∏—Ä–∞—è—Å—å –Ω–∞ –¥–∞–Ω–Ω—ã–µ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –≤—ã–≤–æ–¥ –æ —Ç–æ–º, —á—Ç–æ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤–ª–∏—è–µ—Ç –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –∂–∏–ª–æ–π –Ω–µ–¥–≤–∏–∂–∏–º–æ—Å—Ç–∏ (–±–æ–ª—å—à–µ –∫–æ–º–Ω–∞—Ç - –¥–æ—Ä–æ–∂–µ –Ω–µ–¥–≤–∏–∂–∏–º–æ—Å—Ç—å)

5. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–Ω–≥–∏ –∑–Ω–∞—á–µ–Ω–∏–π –∫–æ–ª–æ–Ω–∫–∏ LSTAT(–ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é (–∑–Ω–∞—á–µ–Ω–∏–µ LSTAT, —Å—Ç–æ–∏–º–æ—Å—Ç—å, —Ä–∞–Ω–≥) —Å—Ä–µ–¥–∏ –≤—Å–µ—Ö –∑–Ω–∞—á–µ–Ω–∏–π LSTAT. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [13]:
tasks+=1
pd.read_sql(
    '''
    SELECT LSTAT, MEDV, Rank_LSTAT FROM(
    SELECT rank() OVER(ORDER BY LSTAT) as Rank_LSTAT, *
    FROM boston)
    WHERE MEDV = (SELECT MAX(MEDV) FROM boston)
    ''',
    con,
)

    LSTAT  MEDV  Rank_LSTAT
0    1.73  50.0           1
1    1.92  50.0           2
2    2.88  50.0           6
3    2.96  50.0           8
4    2.97  50.0           9
5    3.16  50.0          15
6    3.26  50.0          17
7    3.32  50.0          18
8    3.70  50.0          26
9    3.73  50.0          27
10   4.45  50.0          41
11   4.63  50.0          50
12   5.12  50.0          67
13   7.44  50.0         141
14   8.88  50.0         181
15   9.53  50.0         203

##### –ü—Ä–æ—Ü–µ–Ω—Ç (LSTAT) –±–æ–ª–µ–µ –Ω–∏–∑–∫–æ–≥–æ —Å—Ç–∞—Ç—É—Å–∞ –Ω–∞—Å–µ–ª–µ–Ω–∏—è –∏–¥–µ—Ç –Ω–∞ —É–≤–µ–ª–∏—á–µ–Ω–∏–µ –≤ –∑–∞–≤–∏—Å–∏–º–æ—Å—Ç–∏ –æ—Ç —Å—Ç–æ–∏–º–æ—Å—Ç—å –Ω–µ–¥–≤–∏–∂–∏–º–æ—Å—Ç–∏.

6. –í—ã–≤–µ–¥–∏—Ç–µ —Å—Ä–µ–¥–Ω—é—é —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≥—Ä–∞–Ω–∏—á–∞—â–∏—Ö —Å —Ä–µ–∫–æ–π(CHAS) –∏ –Ω–µ—Ç (–≥—Ä–∞–Ω–∏—á–∏—Ç/–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç, —Å—Ç–æ–∏–º–æ—Å—Ç—å)

In [14]:
tasks+=1
pd.read_sql(
    """
    SELECT AVG(MEDV) as '–°—Ä–µ–¥–Ω—è—è —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤', '–ì—Ä–∞–Ω–∏—á–∏—Ç' as "–ì—Ä–∞–Ω–∏—á–∏—Ç –ª–∏ —Å —Ä–µ–∫–æ–π"
    FROM boston
    WHERE CHAS = 1
    
    UNION ALL
    SELECT AVG(MEDV), '–ù–µ –≥—Ä–∞–Ω–∏—á–∏—Ç'
    FROM boston
    WHERE CHAS = 0
    """,
    con,
)

   –°—Ä–µ–¥–Ω—è—è —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –ì—Ä–∞–Ω–∏—á–∏—Ç –ª–∏ —Å —Ä–µ–∫–æ–π
0                28.440000            –ì—Ä–∞–Ω–∏—á–∏—Ç
1                22.093843         –ù–µ –≥—Ä–∞–Ω–∏—á–∏—Ç

7. –í—ã–≤–µ–¥–∏—Ç–µ –≤—Å–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö —Å—Ä–µ–¥–Ω–µ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –≤—ã—à–µ, –∫–æ–≥–¥–∞ –¥–æ–º –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [15]:
tasks+=1
pd.read_sql(
    '''
    SELECT * FROM(
    SELECT 'CRIM' as 'Name_col', (SELECT AVG(CRIM) FROM boston WHERE CHAS = 0) as 'CHAS_0', 
    (SELECT AVG(CRIM) FROM boston WHERE CHAS = 1) as 'CHAS_1'
    
    UNION ALL
    SELECT 'ZN' as 'Name_col', (SELECT AVG(ZN) FROM boston WHERE CHAS = 0) as 'CHAS_0', 
    (SELECT AVG(ZN) FROM boston WHERE CHAS = 1) as 'CHAS_1'
    
    UNION ALL
    SELECT 'INDUS' as 'Name_col', (SELECT AVG(INDUS) FROM boston WHERE CHAS = 0) as 'CHAS_0', 
    (SELECT AVG(INDUS) FROM boston WHERE CHAS = 1) as 'CHAS_1'
    
    UNION ALL
    SELECT 'NOX' as 'Name_col', (SELECT AVG(NOX) FROM boston WHERE CHAS = 0) as 'CHAS_0', 
    (SELECT AVG(NOX) FROM boston WHERE CHAS = 1) as 'CHAS_1'
    )
    WHERE CHAS_0 < CHAS_1
    ''',
    con,
)

  Name_col     CHAS_0     CHAS_1
0    INDUS  11.019193  12.719143
1      NOX   0.551817   0.593426

##### –ù–∞ —É—á–∞—Å—Ç–∫–∞—Ö —É —Ä–µ–∫–∏ –≤—ã—à–µ –ø–æ–∫–∞–∑–∞—Ç–µ–ª—å –¥–æ–ª–∏ –∞–∫—Ä–æ–≤ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ –±–∏–∑–Ω–µ—Å–∞ –∞ —Ç–∞–∫–∂–µ –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞.

8. –í—ã–≤–µ–¥–∏—Ç–µ –∑–Ω–∞—á–µ–Ω–∏—è –¥–æ–ª–µ–π –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏(INDUS), –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞(NOX) –∏ –ø–æ –∏—Ö –ø–µ—Ä—Ü–µ–Ω—Ç–∏–ª—è–º - 10, 20 ... 100 ( –ø–µ—Ä—Ü–µ—Ç–∏–ª—å(10,20...100),–∑–Ω–∞—á–µ–Ω–∏–µ INDUS, –∑–Ω–∞—á–µ–Ω–∏–µ NOX). –ù–∞–ø–∏—à–∏—Ç–µ –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è –º–µ–∂–¥—É –Ω–∏–º–∏ –≤–∑–∞–∏–º–æ—Å–≤—è–∑—å

In [13]:
tasks+=1
pd.read_sql(
    '''
    WITH data as(    
    SELECT *, ntile(10) over(order by nox) as nox_prc,
              ntile(10) over(order by indus) as indus_prc
    FROM boston)
    
    
SELECT  t1.percentile, nox_value, indus_value
FROM 
       (SELECT distinct nox_prc*10 as percentile, max(nox) over(partition by nox_prc) nox_value
        FROM data ) t1 JOIN
        (SELECT distinct indus_prc*10 as percentile, max(indus) over(partition by indus_prc) indus_value
        FROM data) t2
ON t1.percentile = t2.percentile
    ''',
    con,
)

   percentile  nox_value  indus_value
0          10      0.426         2.89
1          20      0.442         4.39
2          30      0.472         5.96
3          40      0.507         7.38
4          50      0.538         9.69
5          60      0.580        13.89
6          70      0.609        18.10
7          80      0.671        18.10
8          90      0.713        19.58
9         100      0.871        27.74

CRIM - —É—Ä–æ–≤–µ–Ω—å –ø—Ä–µ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –Ω–∞ –¥—É—à—É –Ω–∞—Å–µ–ª–µ–Ω–∏—è
ZN - –¥–æ–ª—è –∑–µ–º–µ–ª—å –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É –∑–æ–Ω–∏—Ä–æ–≤–∞–Ω–∞ –ø–æ–¥ —É—á–∞—Å—Ç–∫–∏ –ø–ª–æ—â–∞–¥—å—é –±–æ–ª–µ–µ 25 000 –∫–≤. —Ñ—É—Ç–æ–≤.
INDUS - –¥–æ–ª—è –∞–∫—Ä–æ–≤ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ –±–∏–∑–Ω–µ—Å–∞ –Ω–∞ –≥–æ—Ä–æ–¥.
CHAS - 1, –µ—Å–ª–∏ –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π, 0 –∏–Ω–∞—á–µ
NOX - –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞ (—á–∞—Å—Ç–µ–π –Ω–∞ 10 –º–∏–ª–ª–∏–æ–Ω–æ–≤)
RM - —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –∫–≤–∞—Ä—Ç–∏—Ä–µ
AGE - –¥–æ–ª—è –∂–∏–ª—ã—Ö –¥–æ–º–æ–≤, –ø–æ—Å—Ç—Ä–æ–µ–Ω–Ω—ã—Ö –¥–æ 1940 –≥.
DIS - –≤–∑–≤–µ—à–µ–Ω–Ω—ã–µ —Ä–∞—Å—Å—Ç–æ—è–Ω–∏—è –¥–æ –ø—è—Ç–∏ —Ü–µ–Ω—Ç—Ä–æ–≤ –∑–∞–Ω—è—Ç–æ—Å—Ç–∏ –ë–æ—Å—Ç–æ–Ω–∞
RAD - –∏–Ω–¥–µ–∫—Å –¥–æ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –∫ —Ä–∞–¥–∏–∞–ª—å–Ω—ã–º –º–∞–≥–∏—Å—Ç—Ä–∞–ª—è–º
TAX - –ø–æ–ª–Ω–∞—è —Å—Ç–∞–≤–∫–∞ –Ω–∞–ª–æ–≥–∞ –Ω–∞ –∏–º—É—â–µ—Å—Ç–≤–æ –∑–∞ 10 000 –¥–æ–ª–ª–∞—Ä–æ–≤ –°–®–ê
PTRATIO - —Å–æ–æ—Ç–Ω–æ—à–µ–Ω–∏–µ —É—á–µ–Ω–∏–∫–æ–≤ –∏ —É—á–∏—Ç–µ–ª–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
B - 1000(Bk - 0.63)^2, –≥–¥–µ Bk –¥–æ–ª—è —á–µ—Ä–Ω–æ–∫–æ–∂–∏—Ö –ª—é–¥–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
LSTAT - % –±–æ–ª–µ–µ –Ω–∏–∑–∫–æ–≥–æ —Å—Ç–∞—Ç—É—Å–∞ –Ω–∞—Å–µ–ª–µ–Ω–∏—è
MEDV - –°—Ä–µ–¥–Ω—è—è —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≤ 1000 –¥–æ–ª–ª–∞—Ä–æ–≤.

In [17]:
if tasks==8:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ